spec/support/vcr_cassettes/Payments/can_get_the_submission.yml

---
http_interactions:
- request:
    method: post
    uri: https://devapi.currencycloud.com/v2/authenticate/api
    body:
      encoding: US-ASCII
      string: login_id=development%40currencycloud.com&api_key=deadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeefdeadbeef
    headers:
      User-Agent:
      - CurrencyCloudSDK/2.0 Ruby/0.17.7
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 16 Jul 2018 09:18:06 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - AWSALB=Eitx/FGN3EPrLRfUj4m3bdN74Evvtb3wuOG1ReBiSPzXZrCa8naOsqZeYE/a84LLcRLWGleKA7X1SHkXyuS2CFNwx2f2VWY8RWJKQWovk7H/twnUy8ZnevMxCGpj; Expires=Mon, 23 Jul 2018 09:18:04 GMT; Path=/
      - __cfduid=d1061aa9ff939c5be99f1eed8c46f70fc1531732684; expires=Tue, 16-Jul-19 09:18:04 GMT; path=/; domain=.currencycloud.com; HttpOnly
      Access-Control-Allow-Origin:
      - "*"
      X-Request-Id:
      - 5feb46eb-699b-40c4-8fc7-df9cad60a38b
      Access-Control-Allow-Methods:
      - POST
      X-Content-Type-Options:
      - nosniff
      Vary:
      - Origin
      Access-Control-Allow-Headers:
      - authorization,Access-Control-Allow-Origin,Content-Type,SOAPAction,X-Auth-Token,Origin,Authority
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Server:
      - cloudflare
      Cf-Ray:
      - 43b3611d8e33bbba-LHR
    body:
      encoding: US-ASCII
      string: '{"auth_token":"deadbeefdeadbeefdeadbeefdeadbeef"}'
    http_version:
  recorded_at: Mon, 16 Jul 2018 09:18:06 GMT
- request:
    method: post
    uri: https://devapi.currencycloud.com/v2/beneficiaries/create
    body:
      encoding: US-ASCII
      string: bank_account_holder_name=Test%20User&bank_country=GB&currency=GBP&name=Test%20User&account_number=12345678&routing_code_type_1=sort_code&routing_code_value_1=123456
    headers:
      X-Auth-Token:
      - deadbeefdeadbeefdeadbeefdeadbeef
      User-Agent:
      - CurrencyCloudSDK/2.0 Ruby/0.17.7
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 16 Jul 2018 09:18:06 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - AWSALB=pPddo35SeNLw41e+IDFX3FoFmp29FdYKaDZOAukXSqvkWV5CQ2R3vosq8EnyF0e98f2uPHfbEFtUiFGXO/taiZkht3vyEqNy7wm0/Jsra2kH/2idcJFjuxs1O/Xp; Expires=Mon, 23 Jul 2018 09:18:06 GMT; Path=/
      - __cfduid=d294a21425beb6795322afff02562d9161531732686; expires=Tue, 16-Jul-19 09:18:06 GMT; path=/; domain=.currencycloud.com; HttpOnly
      Access-Control-Allow-Origin:
      - "*"
      X-Request-Id:
      - 7d734f24-9714-41d1-a54b-f874a0ecdfb3
      Access-Control-Allow-Methods:
      - POST
      X-Content-Type-Options:
      - nosniff
      Vary:
      - Origin
      Access-Control-Allow-Headers:
      - authorization,Access-Control-Allow-Origin,Content-Type,SOAPAction,X-Auth-Token,Origin,Authority
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Server:
      - cloudflare
      Cf-Ray:
      - 43b361284b1ebbcc-LHR
    body:
      encoding: US-ASCII
      string: '{"id":"fefe1c10-9e62-48d2-9b97-7304bb9e40f4","bank_account_holder_name":"Test
        User","name":"Test User","email":null,"payment_types":["priority","regular"],"beneficiary_address":[],"beneficiary_country":null,"beneficiary_entity_type":null,"beneficiary_company_name":null,"beneficiary_first_name":null,"beneficiary_last_name":null,"beneficiary_city":null,"beneficiary_postcode":null,"beneficiary_state_or_province":null,"beneficiary_date_of_birth":null,"beneficiary_identification_type":null,"beneficiary_identification_value":null,"bank_country":"GB","bank_name":"TEST
        BANK NAME","bank_account_type":null,"currency":"GBP","account_number":"12345678","routing_code_type_1":"sort_code","routing_code_value_1":"123456","routing_code_type_2":null,"routing_code_value_2":null,"bic_swift":null,"iban":null,"default_beneficiary":"false","creator_contact_id":"97bd468f-c7bc-446f-ba68-dd8cf2bddef2","bank_address":["TEST
        BANK ADDRESS"," NOT USING EXTERNAL SERVICE"," DEVELOPMENT ENVIRONMENT."],"created_at":"2018-07-16T09:18:06+00:00","updated_at":"2018-07-16T09:18:06+00:00","beneficiary_external_reference":null}'
    http_version:
  recorded_at: Mon, 16 Jul 2018 09:18:06 GMT
- request:
    method: post
    uri: https://devapi.currencycloud.com/v2/payments/create
    body:
      encoding: US-ASCII
      string: currency=GBP&beneficiary_id=fefe1c10-9e62-48d2-9b97-7304bb9e40f4&amount=1000&reason=Testing%20payments&reference=Testing%20payments&payment_type=regular
    headers:
      X-Auth-Token:
      - deadbeefdeadbeefdeadbeefdeadbeef
      User-Agent:
      - CurrencyCloudSDK/2.0 Ruby/0.17.7
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 16 Jul 2018 09:18:07 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - AWSALB=35mC30qH9ESAuuaxoBcNINoaAFsOZ/mAeJoTgI3k3L1eJkU0XKwJLFpB2AkEdsEM5y4Vxxami7H1eiqhOxK64KhH1U1v03/O64YO27We8J9A4Fdzi5knhIfk2Fha; Expires=Mon, 23 Jul 2018 09:18:06 GMT; Path=/
      - __cfduid=d4aecdab018d0b197e1136cc064a5c3e61531732686; expires=Tue, 16-Jul-19 09:18:06 GMT; path=/; domain=.currencycloud.com; HttpOnly
      Access-Control-Allow-Origin:
      - "*"
      X-Request-Id:
      - fdf86e2a-cf9a-4266-96e8-b0f63d188543
      Access-Control-Allow-Methods:
      - POST
      X-Content-Type-Options:
      - nosniff
      Vary:
      - Origin
      Access-Control-Allow-Headers:
      - authorization,Access-Control-Allow-Origin,Content-Type,SOAPAction,X-Auth-Token,Origin,Authority
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Server:
      - cloudflare
      Cf-Ray:
      - 43b3612b8ae4bbae-LHR
    body:
      encoding: US-ASCII
      string: '{"id":"af7cb12e-56d1-41a9-983d-a47927609e32","amount":"1000.00","beneficiary_id":"fefe1c10-9e62-48d2-9b97-7304bb9e40f4","currency":"GBP","reference":"Testing
        payments","reason":"Testing payments","status":"ready_to_send","creator_contact_id":"97bd468f-c7bc-446f-ba68-dd8cf2bddef2","payment_type":"regular","payment_date":"2018-07-16","transferred_at":"","authorisation_steps_required":"0","last_updater_contact_id":"97bd468f-c7bc-446f-ba68-dd8cf2bddef2","short_reference":"180716-MWSMWM001","conversion_id":null,"failure_reason":"","payer_id":"08200442-7a72-4260-baa3-041d0535051e","payer_details_source":"account","created_at":"2018-07-16T09:18:07+00:00","updated_at":"2018-07-16T09:18:07+00:00","payment_group_id":null,"unique_request_id":null,"failure_returned_amount":"0.00","ultimate_beneficiary_name":null}'
    http_version:
  recorded_at: Mon, 16 Jul 2018 09:18:07 GMT
- request:
    method: get
    uri: https://devapi.currencycloud.com/v2/payments/af7cb12e-56d1-41a9-983d-a47927609e32/submission
    body:
      encoding: US-ASCII
      string: ''
    headers:
      X-Auth-Token:
      - deadbeefdeadbeefdeadbeefdeadbeef
      User-Agent:
      - CurrencyCloudSDK/2.0 Ruby/0.17.7
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 16 Jul 2018 09:18:07 GMT
      Content-Type:
      - application/json;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - AWSALB=/6jU7TfV1kIoKJzny4kQgKBL1UKQBlKqEmxv7XeGzpNIvXKBNPQCRlYf2ZO9Lb00aY6r9gXQRQllgBwLcGYPy22UCX98x1PG88LpOrtMSUm01Zv4aHzRUueOaI4z; Expires=Mon, 23 Jul 2018 09:18:07 GMT; Path=/
      - __cfduid=d28f922ef766a399aec7f05f79530e3341531732687; expires=Tue, 16-Jul-19 09:18:07 GMT; path=/; domain=.currencycloud.com; HttpOnly
      Access-Control-Allow-Origin:
      - "*"
      X-Request-Id:
      - 850d1fe4-76f8-4863-b8f3-c764f7b2cef5
      Access-Control-Allow-Methods:
      - GET
      X-Content-Type-Options:
      - nosniff
      Vary:
      - Origin
      Access-Control-Allow-Headers:
      - authorization,Access-Control-Allow-Origin,Content-Type,SOAPAction,X-Auth-Token,Origin,Authority
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Server:
      - cloudflare
      Cf-Ray:
      - 43b36130eeeebbe4-LHR
    body:
      encoding: US-ASCII
      string: '{"status":null,"mt103":null,"submission_ref":null}'
    http_version:
  recorded_at: Mon, 16 Jul 2018 09:18:07 GMT
recorded_with: VCR 4.0.0
